#!/usr/bin/env python3
# -*- coding: utf-8 -*-
"""
Created on Sat Aug 14 21:57:56 2021

@author: cui_hao
"""
# 转发网络 
#server_crawl_repost.py
import pandas as pd
import os
#from datetime import datetime, timedelta
import random
import requests
from bs4 import BeautifulSoup
import re
import time

#cwd = "/mnt/sdb1/cuihao/keywords"
cwd = '/Users/cui_hao/Documents/GitHub/Emergence_Popularity_Sina_Weibo/clustered grouped'
#cwd = '/Users/cui_hao/OneDrive - Central European University/CEU/0thesis_publications/Data_stories_2022'
os.chdir(cwd)
# 要非常注意directory!!!
type_group_cluster = "group2_cluster3"

#"group3_cluster2"
#"group3_cluster3"
#"group2_cluster2"
#"group1_cluster3"
#"group1_cluster2"

#"group1_cluster1"
#"group2_cluster3"
#
#
#"group2_cluster1"
#"group1_cluster3" 

text_file = open( type_group_cluster + ".txt", "r")
groups_clusters = text_file.read().split('\n')  
text_file.close()
groups_clusters = list(filter(None, groups_clusters)) #576 需要filter None!!!!

print(len(groups_clusters)) #408 #576 #410


#social_hashtags = groups_clusters

today_cookie_mobile = " SSOLoginState=1653994392; SUB=_2A25PkYPHDeRhGeFN71sS8SzFwjWIHXVtfS2PrDV6PUJbktB-LXfzkW1NQAOoWgg2uR-J-psO-i_4rlJKeoRIUGi2; SUBP=0033WrSXqPxfM725Ws9jqgMF55529P9D9WFebFUdhj4ecuLMYZc.yuio5NHD95QNe0B4e02E1K.4Ws4Dqcj_i--4i-82iKysi--ciK.Ni-27i--Ni-i8i-2pi--fi-z7iK.pi--Xi-i8i-27; _T_WM=cf5194d98d53499813dcd5fcca8af07f"
#"_T_WM=cf5194d98d53499813dcd5fcca8af07f; SUB=_2A25PGuv8DeRhGeFN71sS8SzFwjWIHXVs5PW0rDV6PUJbktANLUmnkW1NQAOoWpEjz2LHZNbnhmNbnqxf3c6NXVeV; SUBP=0033WrSXqPxfM725Ws9jqgMF55529P9D9WFebFUdhj4ecuLMYZc.yuio5NHD95QNe0B4e02E1K.4Ws4Dqcj_i--4i-82iKysi--ciK.Ni-27i--Ni-i8i-2pi--fi-z7iK.pi--Xi-i8i-27"

cook_mobile = {"Cookie": today_cookie_mobile}

user_agent = "Mozilla/5.0 (Macintosh; Intel Mac OS X 10_14_6) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/79.0.3945.130 Safari/537.36"

#"Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/94.0.4606.71 Safari/537.36"

header = { 'User-Agent' : user_agent}

# https://weibo.cn/repost/JbCmgg3ev?uid=2009113272&rl=1

def GetMobileUrl(web_link):
    rand_letter = web_link.split("?")[0].split("/")[-1]
    userid = re.compile(".*/(\d+)").match(web_link).group(1)
    mobile_url = "https://weibo.cn/repost/" + rand_letter + "?uid=" + userid + "&rl=1"
    return mobile_url

def getUrlList(Mobile_url):   #should be a string, the last part of the url
    """
    获取一个根的所有的转发页面链接
    :param url: 主页面链接
    :return: 所有评论链接 
    """
    cook_mobile = {"Cookie": today_cookie_mobile}
    
    form_action = Mobile_url.split("/")[-1]
    #form_action = form_action_url
    #url = comment_page + form_action  #string可以相加
    
    time.sleep(random.uniform(0.9, 3.5)) #randint
    
    html = requests.get(Mobile_url, cookies=cook_mobile, headers = header).content  #
    soup = BeautifulSoup(html, "lxml") #html.parser
    form = soup.find("form", attrs={"action": "/repost/" + form_action})
    
    if form is None: 
        
        url_list = [Mobile_url]
        
    else:
        #a = form.find('a').get('href')
        #b = a[0:len(a)-1] #页面的第一部分
        b = Mobile_url + "&page="
        c = form.find("div").text.split("/")[1]
        d = len(c) -1
        e = c[0:d]        #评论的页数
        url_list = []
        for i in range(1,int(e) + 1):
            url_list.append(b + str(i))
    url_list.reverse()
    return url_list

####################################

def GetRepost(all_url):
    
    cook_mobile = {"Cookie": today_cookie_mobile}
    
    try:
        weiboRepost=open(str(time.strftime('%Y%m%d%H%M%S',time.localtime()))+"repost.csv", 'w')
        title = '原用户名\t原内容\t原发布时间\t转发用户名\t转发用户id\t转发内容\t点赞数\t转发时间\t转发来源\n' #\
        print(title.replace("\n",""))
        weiboRepost.write(title)
        
        html = requests.get(all_url[-1], cookies=cook_mobile, headers = header).content
        soup = BeautifulSoup(html, "lxml")
        r = soup.findAll('div', attrs={"class": "c"})
            
        origin_username = soup.find("div", attrs={"id": "M_"}).find("a").text     
        origin_content = soup.find("div", attrs={"id": "M_"}).find("span", attrs={"class": "ctt"}).text 
        origin_time = soup.find("div", attrs={"id": "M_"}).find("span", attrs={"class": "ct"}).text 
        #for i in all_url[20:]:
        for i in all_url:
            time.sleep(random.uniform(0.3, 2.5)) #(0.5, 3.5) #randint (3,8)

            if all_url.index(i) > 0 and all_url.index(i) % 30 == 0:
                
                time.sleep(70) 
            
            html = requests.get(i, cookies=cook_mobile, headers = header).content
            
            soup = BeautifulSoup(html, "lxml")
            r = soup.findAll('div', attrs={"class": "c"}) ##???
            for j in r[4:]: #4, should be 4; 3 这里应该是3;
                
                if j.find_all('a',href=re.compile("/u")) != []:
                    #item = j.find_all('a',href=re.compile("/u")) # it is a list, length is 1.
                    #userid = item[0].get("href").split("/")[2]
                    ########## Wrong！！！！！不是userid!!!!!!!!!!错了！！！！！！
                    userid = re.compile(".*/(\d+)").match(str(j.find_all('a')[0])).group(1)
                    #username = j.text.split('\xa0')[0].split(':')[0]
                    rep_username = j.find("a").text
                    repost_content = j.text.split('\xa0')[0] #.split(':')[1] 
                    #numlikes = j.text.split("\xa0")[-3]
                    if len(j.text.split('\xa0')) != 1:
                        numlikes = j.text.split('\xa0')[1]
                        repost_time = j.text.split('\xa0')[2]
                        from_device = j.text.split('\xa0')[3]
                        line = origin_username + "\t" + origin_content + "\t"+ origin_time +"\t" + rep_username + "\t" + userid + "\t" + repost_content + "\t" + numlikes + "\t" + repost_time + "\t" + from_device + "\n"
                        #line = userid + "\t" + username + "\t" + repost_content + "\t" + numlikes + "\t" + repost_time + "\t" + origin + "\n"
                        print(line.replace("\n", ""))
                        #weiboRepost.write(line)    
            
                if j.find_all('a',href=re.compile("/u")) == [] and j.text.split('\xa0')[0] !="" : #type(re.compile(".*/(\w*\d*)").match(str(j.find_all('a')[0]))) == re.Match and 
                    
                    userid = re.compile(".*/(\w*\d*)").match(str(j.find_all('a')[0].get("href"))).group(1)
                    rep_username = j.text.split('\xa0')[0].split(':')[0]
                    if len(j.text.split('\xa0')) != 1:
                        repost_content = j.text.split('\xa0')[0] #.split(':')[1]
                        numlikes = j.text.split('\xa0')[1]
                        repost_time = j.text.split('\xa0')[2]
                        from_device = j.text.split('\xa0')[-1]
                        line = origin_username + "\t" + origin_content + "\t"+ origin_time +"\t" + rep_username + "\t" + userid + "\t" + repost_content + "\t" + numlikes + "\t" + repost_time + "\t" + from_device + "\n"
                        print(line.replace("\n", ""))
                        #weiboRepost.write(line)                            
                
                print(line.replace("\n", ""))
                #if href.find("javascript:void(0)") != -1:
                    #line = str(index) + "\t" + title + "\t" + hot + "\t" + date +"\t"
                #写入文件
                weiboRepost.write(line)    
                
                 #考虑个性域名，字母在前，数字在后, 数字也可能不出现。   
                 
        weiboRepost.close()
        
    #except socket.timeout:
    except Exception:
        print("Exceptions")
    except urllib.error.URLError:
        print('The handshake operation timed out')
    #except http.client.RemoteDisconnected:
    #    print("Remote end closed connection without response")   
    #except http.client.IncompleteRead:
    #    print("IncompleteRead")
    except NameError:
        print("Name Timeout is not defined")
    #except error.URLError as err: 
    #    print("Error description:",err.reason)
    #except error.HTTPError as err:
    #    print("Error description:", err.reason)
    except ConnectionError:
        print("Error description: Socket error timed out.")  

###########################################################################################
#group1_cluster3
# 三浦春马10年前写给自己的信 11, not completed, 19th link
# 31省区市新增确诊16例 13, not, 74th link

#group3_cluster3
# 金鹰奖宣传片: 14
# 奶奶陪渐冻症孙女参加中考: 23
# 上海遛狗 30
# 秦昊东升旅行社导游 35 
# 特朗普自夸疫情发布会收视率超高 44 maybe not complete 
# 安徽巢湖中庙寺被淹 54 not completed
# '受过军训的饺子' 58
# 路小北没有救回哥哥 66 not completed 
# 录3年求婚视频男主回应 78 not completed, 23th link
# 周杰伦直播 87 start from 98th link
        
        

#for keyword in groups_clusters[14:100]:   # try just one element in the list #social_hashtags:

df_up_hashtag = ['法国室内公共场所强制佩戴口罩',
 '汽车日租价降幅达50%',
 '南特大教堂火灾或系人为',
 '排球少年完结',
 '有剧情的红绿灯',
 '广发证券保荐资格被暂停',
 '航拍恩施堰塞湖',
 '浪漫轨迹',
 '澳军准航母在南海与中国海军对峙',
 '大连全市现场招聘活动暂停',  #broke from 7th 
 '电排站回应采购360吨黄豆防汛',
 '王者世冠小组赛收官',
 '71岁老人5次高考终圆梦',
 '大连志愿者防护服拧出汗水',
 '瑞幸称被立案调查不会影响门店运营',
 '疫情中处在十字路口的旅游业',
 '杨英格回应退赛',
 '王者世冠应援歌曲',
 '新疆新增22例本土病例',
 '大连向足协申诉',
 '严浩翔翻唱安静',
 '北京重启消费季',
 '博茨瓦纳北部出现约350头非洲象尸体',
 '偶像梦幻祭', #broke from 38th 源数据有问题，已改正 
 '四川乐山洪峰过境',
 '第一创业', # too old in history, discard  
 '马刺无缘季后赛',
 '失去家的玩具们',
 '西班牙人续约武磊',
 '国内油价上调',
 '7月稀土出口下降近70%',
 '全国各地点亮地标为科比庆生',
 '自己身上的神奇点',
 '2020世界城市名册',
 '七夕蜜桃约会妆',
 '深圳特区40年',
 '六部门发文治理未成年人网络环境',
 '给闺蜜安利爱豆的样子',
 '巴托梅乌',
 '孟子坤世界末日',
 'FPX拿到赛点',
 '东京街头的繁华',
 '合肥冰雹',
 '滴水成画',
 '忍不住代入孙弈秋',
 '青岛凤凰音乐节', ##2019年的不要
 '任嘉伦薇娅直播',
 '股票新基金募资降3成',
 'LCK冒泡赛',
 '中超外援倒钩进球',
 '法国黄马甲示威游行在疫情中卷土重来',
 '吴彤时代少年团合影',
 '空军空降兵最新宣传片',
 '10位铁骑队员3分钟徒手推走抛锚车',
 '兵哥哥真人版演示手枪如何工作',
 '车艺照大赛',
 '军训照挑战',
 '我与冲浪只差个自拍杆',
 '电子竞技莫得感情',
 '白昊天反击江子算',
 '趣头条整改',
 '25省份上半年GDP出炉',
 '湖人战胜魔术',
 '宋祖儿喊话跟拍',
 '张雨绮撞衫Jennie',
 '意大利海上救援犬组织30年救起上千人',
 '掘金vs快船',
 '孟美岐跳霸王别姬'] 

############---------------------
group2_cluster1_lower = ['趣头条道歉',
 '乌鲁木齐地铁1号线停运',
 '315曝光趣头条虚假广告',
 '山东即墨查处问题海参',
 '金盆洗手之后的吴邪',
 '世界死亡病例超58万',
 '新疆新增本土病例1例',
 '上海全覆盖检查汉堡王',
 '香港经深港口岸入境须持核酸证明',
 '中国驻洛杉矶总领馆提醒当心山谷热',
 '美国凤凰城地区3中国公民患山谷热',
 '10岁男孩用零花钱给抗洪战士买糖',
 '山东连夜派出调查组赶赴即墨',
 '新疆昌吉公交暂停营运',
 '江湖预告',
 '长征五号火箭垂直转运至发射区',
 '长江2020年第2号洪水',
 '2020港姐15强诞生',
 '扎克伯格连线福奇',
 '美国新冠感染病例超355万',
 '宁静对郑希怡说我不希望失去你',
 '乘风破浪的姐姐三公分组',
 '消防员拿第一获准外出后的步伐',
 '韩国棋手AI作弊被判监禁',
 '新疆专升本考试延期举行',
 '乌鲁木齐机场航班大量取消',
 '国务院联防联控机制联络组离鄂返京',
 '申长友', #no such
 '李宇春自评级X',
 '49名退役军人一天内赶回家乡抗洪',
 '电影院复映片单',
 '一中学生连获三年全国青创赛奖项',
 '日本6月外国游客仅约2600名',
 '舞蹈生迷惑行为图鉴', #no such 
 '西班牙将扑杀10万只养殖貂',
 '中国全球化品牌50强榜单',
 '巴菲特4个月从苹果赚400亿美元',
 '兽药店库房查出土霉素原粉',
 '当两个孤独的人相遇',
 '岳云鹏沙溢蹭饭版无价之姐',
 '台军直升机坠毁画面',
 'Haro的盲僧',
 '北京7月21日进入主汛期',
 '下周北方将进入主汛期',
 '青岛即墨区自然资源局副局长被查',
 '校方回应中学生连获三年青创赛奖',
 '淮河发生2020年第1号洪水',
 '乌鲁木齐已启动疫情应急响应预案',
 '江西鄱阳中洲圩决口合龙',
 '美国加州幼儿园已报告近1000例确诊']


group2_cluster2_up = ['北京将稳妥有序推进电影院恢复开放',
 '安徽32条河湖超警戒水位',
 '暮白首大结局',
 '莫高窟单日游客最大限量调整为50%',
 '国防科大版无价之姐',
 '影院重启首日大学生连看四场',
 '全国电子烟市场首张罚单',
 '官方回应西安足球场禁止踢球',
 '北京电影院开启预售',
 '中国全网5G用户破亿',
 '福奇为美职棒新赛季开球',
 '深圳暖夜灯柱',
 '福布斯全球品牌价值100强',
 'Somi舞台',
 '乐队的夏天可太帅了',
 '吴前好厉害',
 '香港新增确诊80例',
 '水上列车驶过天空之镜',
 '浙江玉环全面排查阳台违规改造',
 '辽宁队淘汰新疆队',
 '韩国试射新型弹道导弹',
 '微软',
 '用玩具还原大话西游经典场景',
 '璇玑花式哄司凤',
 '唱过夏天', #26th broke
 'Otto解说',
 '北京电影院上座率上限调至50%',
 '缓解头痛的小方法',
 '时刻保持微笑的方法',
 '中国参加武器贸易条约缔约国大会',
 '被孙雯雯气死',
 '新西兰流浪猫与总理竞争年度人物',
 '当代爱情图鉴',
 '七夕蛤蟆',
 '居民回应豪华中学部分设施被拆',
 '山东荣成休渔期非法捕捞调查',
 '原路返回的可爱小鹿',
 '风月不相关将拍剧',
 '白色月光大结局',
 '2020高考暖心结局',
 '韦神解说',
 'S10资格赛',
 '中国96B坦克与俄T72坦克同场竞速',
 '亚马逊无人机获批',
 '深圳进入强制垃圾分类时代',
 '火箭雷霆抢七',
 '信条解析',
 '易建联寄语年轻球员',
 '孙弈秋有骨气',
 '中国每日航班量恢复到疫情前九成',
 '76岁大爷勇救200斤溺水小伙',
 '张伯礼获奖后第一天',
 '日本女足运动员加盟男队',
 '兰芊翊背锅',
 '猫先拿回来 手机可以慢慢等',
 '湖南援鄂医生送儿子武大报到',
 '寝室环境大赛',
 '美印将签关键军事协议共享信息',
 '郝帅撒娇',
 '美国西部山火持续肆虐',
 '全国多地景区门票降价',
 '统计局回应房地产市场回暖',
 '15种语言版你曾是少年',
 '第11号台风红霞',
 '泰国将提供270天旅游签证']


group3_cluster2_up = ['3岁女童凌晨独自上街小伙一路护送',
 '三十而已和二十不惑串场',
 '三十而已的男性角色',
 '中国女排版无价之姐',
 '优马铁子',
 '信条女主190',
 '健身教练的视角',
 '关晓彤四分之三减龄妆',
 '准研究生虐狗事件狗主人不接受道歉',
 '剑仙回归',
 '剑网3十一周年',
 '北京允许举办500人以下体育赛事活动',
 '北大回应留守女生报考考古专业',
 '口罩的防晒效果有多好',
 '吉野家将关闭含中国市场内150家门店',
 '唐国强老师演过的角色',
 '唯一的好男人是许子言',
 '大连女子隆胸去世医方承担完全责任',
 '姜贞羽恋情',
 '孙子跪地给七旬奶奶拍写真',
 '宁静李斯丹妮抢王霏霏',
 '张玉环案或申请约700万国家赔偿',
 '张艺兴 嘲笑我可以不要嘲笑努力',
 '把男朋友叫做普通朋友',
 '抹茶杏仁豆腐奶冻',
 '教育类硕士毕业生免试认定教师资格',
 '昊辰卷土重来',
 '杭州失踪女子居住小区居民献花祭奠',
 '林有有段位',
 '武汉东湖之眼摩天轮',
 '武汉菜市场卖野生青蛙',
 '父亲为弥补儿子亲手改造房间',
 '白桃乌龙青森冰沙',
 '羊城十二时辰',
 '羊能长得多潦草',
 '肖战自拍',
 '肯塔基州两支游行队伍现场对峙',
 '阚清子说朱一龙神秘',
 '阻止性侵被咬耳男子称不后悔',
 '阿里巴巴注册新公司京西']

group2_cluster3_up = ['1元抗癌厨房墙上留下不少电话号码',
 '3岁女孩被爸妈喂到70斤当吃播赚钱',
 '7岁女童商场偷拿玩具亲妈报警',
 '7省市将有大到暴雨',
 'AI技术复原91年前黑白视频颜色',
 'Angelababy回复章子怡',
 'TFBOYS演唱会单人机位',
 'iPhone12 Pro玻璃后壳曝光',
 '一只装满水的气球扎破瞬间',
 '乐山大佛脚趾露出',
 '乘风破浪的姐姐复活换位战',
 '乘风破浪的铁三角',
 '入狱4年手机被经办民警私用',
 '凌霄和李尖尖的CP名',
 '刘心悠 我喜欢谣言',
 '厦门两名高级警长同日殉职',
 '吴镇宇念王一博粉丝祝福语',
 '喂鲤鱼当消遣的黑天鹅',
 '四川宜宾通报路面塌陷',
 '多本爆特朗普黑料新书销量猛增',
 '女子被家暴高速收费站求助获救',
 '孔雀溜进图书馆',
 '学历鄙视链真存在吗',
 '宁静爸爸好年轻',
 '张朝阳称自己每天只睡4个小时',
 '张雨绮舞蹈进步好多',
 '张馨予呼吁不要对女演员胖瘦太苛刻',
 '当你发现队友在谈恋爱',
 '快乐源泉蔡国庆',
 '想象中给骑车的男友打伞',
 '我国新一轮降雨将启程',
 '我有一个梦想演讲57周年美国民众游行',
 '新疆宣布全面恢复正常生产生活秩序',
 '新疆新增17例本土病例',
 '日系初恋心动妆',
 '明年将禁用不可降解塑料袋',
 '景区上演现实版鱼跃龙门',
 '杜华 我自己打了自己的脸',
 '森碟腿部线条',
 '水果姐产后身材',
 '江西入室杀两人嫌犯又杀一人',
 '湖人时隔十年再进西决',
 '特朗普成为美国共和党总统候选人',
 '特朗普承认曾淡化新冠疫情严重性',
 '特朗普计划在白宫为弟弟举行葬礼',
 '猛龙战胜凯尔特人',
 '瑞幸咖啡单店现金流已转正',
 '璇玑切大号',
 '男子5000米世界纪录告破',
 '男子口罩内藏作弊器考科目一',
 '白天开饭店晚上挖地道盗文物',
 '硝酸铵是什么',
 '童瑶气质',
 '紫禁城600年一见如故',
 '罗冠军称梁颖方愿意公开道歉',
 '美国3000多专家联名挺福奇',
 '美国新冠肺炎确诊超491万例',
 '美国现十年来最大破产潮',
 '药水哥打拳',
 '谢霆锋谈年轻艺人排场大',
 '钟晓芹钟晓阳好甜',
 '钟晓阳暖男',
 '陈养鱼许放炮梁海王',
 '韩国植物园立安倍下跪谢罪雕像',
 '顾佳被骗',
 '香港教育局称教科书不应出现违法内容',
 '骑手摔残废了手机还在自动接单']

group1_cluster1_up = ['万只白鹭田野中齐飞',
 '全球单日新增新冠肺炎近30万例',
 '大波浪改编爱情买卖',
 '民警创作歌曲揭10种校园诈骗',
 '第12个全民健身日',
 '詹姆斯大帽威少',
 '雨后彩虹照']

group1_cluster2_up = ['30吨橘子散落高速没人哄抢',
 '70岁宝藏奶奶靠时装火出圈',
 'LGD状态',
 '上海大学开学礼物送干湿垃圾桶',
 '上海整治养犬行为违规者当场罚款',
 '仪陇通报400字官方回复错4字',
 '哪一刻决定开始养猫',
 '四行仓库客流量猛增两倍',
 '大连人vs恒大',
 '日本铲屎官记录自家猫咪叫声',
 '杭州失踪女子尸体在小区化粪池找到',
 '胡明轩三分球']

group1_cluster3_up = ['李遐怡新歌MV', '路小北和许蔚摊牌']

group2_cluster1_up = ['14款游戏APP存在隐私问题',
 '2020未来科学大奖获奖人揭晓',
 '9月1日起成都天然水域全面禁捕10年',
 'CLC新歌MV',
 'S10抽签仪式嘉宾',
 '一颗高楼大小行星将飞过地球',
 '下半年最想看到的电影',
 '中国方便面海外买家翻倍',
 '云南今年来野生菌中毒已致12死',
 '井底蛙顺着绳子奋力往岸上爬',
 '八月星空',
 '再无法超越的经典角色',
 '分享欲有多重要',
 '刘雨昕金丝眼镜', #53 broke
 '北京学校食堂不得制售冷食生食',
 '北京环球影城明年5月开园',
 '区块链金融顶层设计出台', 
 '卫健委明确抑郁症防治四类重点人群',
 '印度连续两日新增确诊破9.5万例',
 '去新疆旅游无需核酸检测及隔离',
 '同济大学军训教官跳女团舞',
 '吹玻璃师傅工作的样子',
 '大连10岁女童被害案法院判赔128万',
 '女艺人能有多敢说',
 '宁静看张雨绮出神忘选手机',
 '小鸟遇人僵直脖子如标本',
 '山西襄汾坍塌饭店老板被刑拘',
 '山顶小学摇滚乐队将开演唱会',
 '巴特勒40分',
 '张玉环前妻称他还欠我一个抱',
 '彭于晏像拉黄包车的车夫',
 '德云社小剧场将恢复演出',
 '德国小镇麦田怪圈',
 '成都300年桂花巷内桂花树全被砍',
 '救人医学生回应获奖1万元',
 '无价之邪',
 '杨幂瑞丽25周年封面',
 '核电站海底种珊瑚',
 '桂花椰汁西米糕',
 '武汉天空像羊群奔跑的云团',
 '武汉百万大学生返校',
 '民间大神打脸现场',
 '湖人球员众生相',
 '独居老人家中摔倒4天靠敲盆获救',
 '王源MV创意',
 '王菲K歌直播',
 '瑞士小镇下起巧克力雨',
 '硬糖少女首张EP',
 '罗云熙仲夏光影大片',
 '美国一夏令营发生集体感染',
 '美国俄勒冈州染成红色',
 '胡一天黄子韬 蜡笔小新',
 '菅义伟正式就任日本首相',
 '詹姆斯季后赛胜场数历史第一',
 '豆腐脑店老板作诗贴满墙',
 '赵丽颖哭的镜头',
 '还没从琉璃走出来',
 '这蜡烛吹得挺突然的',
 '逃离家暴有多难',
 '金晨郁可唯表情包',
 '陈木胜追思会',
 '隐秘的角落 切片式混剪',
 '零食托',
 '霍格沃茨学院妆',
 '青春芒果夜阵容', #青春芒果节官微 broke
 '韩国近七成80岁以下老人想工作',
 '香港新增新冠肺炎确诊113例',
 '黄子韬加盟说唱新世代']

group1_cluster1_down = ['写信力挺援港医护的港警收到回复了',
 '创业板注册制首批企业8月24日上市',
 '制造业PMI连续5个月在临界点以上',
 '北京企业乱倒建筑垃圾最高罚100万',
 '多肉乌龙青提沙',
 '女性科技人力资源比例进一步提升',
 '安徽解除紧急防汛期',
 '少儿读物类图书均价上涨超2成',
 '线下独处线上热闹成常态',
 '西藏加林山岩画上的动物世界',
 '连狗子都会玩滑板了',
 '首批火星地形地貌中文推荐译名']


group1_cluster2_down = ['00后内向男孩成国内首位手语翻译',
 '为战疫功勋护航21车队形是最高规格',
 '抚顺3.0级地震',
 '杭州金边云',
 '现在军训的才艺技能有多丰富',
 '约基奇三双创历史',
 '纳达尔退出2020年美网',
 '蓝色格纹穿搭',
 '西亚卡姆脚踢对手',
 '遵义欧亚医院总经理获刑20年',
 '重启特化']

group1_cluster3_down = ['KPL韩信星元皮肤',
 'SpaceX首批星际飞船乘客',
 '亲历者讲述国航航班突降千米',
 '大坂直美罢赛',
 '孤day打歌蛤蟆',
 '当给宠物加上特效',
 '影子银行规模三年缩减16万亿',
 '日本新内阁名单公布',
 '毛阿敏毛不易神仙合唱',
 '滞留乌市人员核酸检测合格后可离开',
 '用狗狗最爱的词语讲故事',
 '给李现P衣服',
 '美46万人庆摩托车节26万人确诊',
 '鄱阳县境内水位呈下降趋势',
 '长城上眺望北京CBD',
 '黎巴嫩司法部长辞职']

group2_cluster2_down = ['TFBOYS合唱Heart',
 '九旬大爷勇救落水男童',
 '北部湾大量珊瑚白化面临死亡',
 '台风过境吉林屋顶被掀树被刮倒',
 '嗨学网退费难',
 '四川强降雨结束',
 '国家卫健委18人专家团队抵达大连',
 '国庆酒店机票价格创5年新低',
 '安徽淮河王家坝关闸',
 '工信部要求严查SDK违规收集用户信息',
 '房地产的广告有多奇葩',
 '把悬崖村搬下悬崖',
 '林俊杰孙燕姿新歌MV',
 '武磊西乙首球',
 '江水已从乐山大佛脚趾退去',
 '现存中华老字号近一半持续亏损',
 '美国至少24州报告高校新冠病例',
 '雅润等5款消毒湿巾虚标酒精浓度']


group3_cluster3_down = ['1200万台第三方产品支持鸿蒙',
 '2岁女童10分钟横渡沾天湖',
 'KPL阿古朵首秀',
 'Mlxg手气',
 '三星电子关闭在华最后一家电脑厂',
 '上万颗钉子做成的立体山水画',
 '中国新冠疫苗在阿联酋获紧急批准',
 '乌克兰前总理季莫申科感染新冠肺炎',
 '周峻纬单场21分',
 '张雨绮 抱你到天亮mua',
 '恋爱脑的反常规操作',
 '杨超越工作室公告',
 '段振宇救姜小果',
 '特朗普考虑大选后撤换国防部长',
 '王一博霸总式选人',
 '王岳伦表白李湘王诗龄',
 '看到情侣的我',
 '综艺里最热闹的场面',
 '这年头水居然会敷面膜',
 '迪士尼在逃生物',
 '钟汉良小宝 什么偶像剧情节',
 '高福接种实验型新冠病毒疫苗']

group3_cluster2_down = ['DNA检测通告吓出高空抛物肇事者',
 'S7冒泡赛兮夜用卡萨丁淘汰iG',
 'iPhone11首次在印度生产',
 '中国代表在联大严厉驳斥美方无端指责',
 '刘永坦捐出最高科技奖800万奖金',
 '加满一箱油将多花3.5元',
 '南开录取通知书送两粒莲花种子',
 '吴尊友称未来出现疫情是一种常态',
 '大连地铁回应老人无健康码乘车受阻',
 '安倍晋三正式宣布辞职',
 '家中起火姐姐带9岁弟弟教科书式避险',
 '当老师让小朋友带一种蔬菜',
 '招生办通报专升本考试疑似泄题事件',
 '日方回应韩国立安倍下跪谢罪雕像',
 '时代少年团微电影',
 '易烊千玺大妈同款拍照姿势',
 '田雨白玉兰最佳男配角',
 '秦霄贤大波浪舞台好炸',
 '美国没资格要求安理会恢复对伊制裁',
 '美国西部97处大规模山火在燃烧',
 '考生伪造清华录取通知书',
 '薇娅李子柒当选全国青联委员',
 '贱内的意思',
 '青簪行预告是原声',
 '黄子韬爸爸去世']

group2_cluster1_down = ['150米盲道被改成十八弯',
 '2020亚洲小姐竞选面试',
 '2020年标准地图发布',
 '31省区市新增确诊14例',
 '347国道发生大面积山体垮塌',
 '8月有5场天象奇观',
 'DWG获得LCK夏季赛冠军',
 'Haro的盲僧',
 'S10抽签仪式时间',
 'THE9首支MV',
 '一旦接受了这个设定后',
 '世卫称全球需要多种类型疫苗',
 '丝滑可可糯米糍',
 '为什么火箭能飞太空飞机却不行',
 '乌童改造玲珑',
 '乌鲁木齐开展全民免费核酸检测',
 '乔丹支持NBA重启',
 '乘风破浪的姐姐三公分组',
 '云南新增境外航空输入病例1例',
 '人类早期驯服四肢的过程',
 '伦敦运河边的芭蕾舞者',
 '何洛洛呼吁粉丝在机场保持秩序',
 '全球二季度最赚钱100家企业',
 '准格尔首试免费接种宫颈癌疫苗',
 '出海观鲸偶遇海豚群狂奔',
 '别用衣架晾口罩',
 '北京警方起底美容贷',
 '北京高校承担学生返校核酸检测费用',
 '十几岁和现在恋爱的区别',
 '南京八卦洲首批人员撤离',
 '参与玉树救援的功勋犬天宝去世',
 '台风美莎克3日中午前后移入吉林',  
 '商务部回应美方再次升级对华为打压',
 '喉舌齿唇的发音部位',
 '在劫难逃刺激',
 '大连中风险封闭社区菜粮供应充足',
 '天津儿童免费乘车身高标准提至1米3',
 '央视记者实地探访乌鲁木齐社区',
 '女生中奖1吨娃哈哈送小朋友',
 '奶奶写的少女日记',
 '如何优雅的表达不满',
 '如何调整你的电脑桌椅',
 '学校复学成美国下一阶段疫情防控挑战',
 '宁吉喆说下半年最大挑战是稳就业',
 '宁静组拉横幅拉票',
 '安徽全椒县滁河实施爆破泄洪',
 '山东龙口一幼儿园校车与大货车相撞',
 '山西一施工罐车往河中倒水泥',
 '师德表现将作为教师职称评审首要条件',
 '广东47岁民警突发疾病倒在工作岗位',
 '广州暂停进口疫区冷冻肉制品和水产品',
 '库兹马三分绝杀',
 '张文宏称正在研究新冠特效药',
 '张萌不好意思找王一博合影',
 '张雨绮山东话rap',
 '徐艺洋 过程比结果重要',
 '微博将整治大胃王吃播内容',
 '德阳安医生自杀案今日开庭',
 '成都2名男子路中积水游泳比赛',
 '我国拟修法明确禁止倒挂国旗',
 '我的青春疼痛',
 '数辆过路车25秒静待老人过马路',
 '方硕最佳第六人',
 '曹操墓出土文物已修复900余件',
 '最喜欢的手机设计',
 '朱朝阳为严良庆生',
 '李斯丹妮中二vlog',
 '杨易脑王之王',
 '林郑月娥率队接受新冠病毒检测',
 '校方回应学生雨夜追星',
 '梦露 伊丽莎白泰勒',
 '汪苏泷线上演唱会', #45 link not finished
 '淮河发生2020年第1号洪水',
 '深航东航相关安全事件调查结果',
 '焦雅辉说希望理解医护不止在今天',
 '父亲回应家属被男子持铁锹暴打',
 '独行侠快船冲突',
 '王一博镜子蹲',
 '王丽坤手劲好大',
 '瑞丽已完成核酸检测全部为阴性',
 '福奇警告称美国疫情正向中西部蔓延',
 '福建下海救人的第三匹马已痊愈',
 '福建漳州龙海一厂房被吹倒',
 '科沃尔恶意犯规',
 '纽约周末发生多起枪击案',
 '网络游戏实名认证系统',
 '美国300家必胜客计划永久关闭',
 '美国扩大召回75款洗手液',
 '美国波特兰示威者推倒法院围栏',
 '老师授课的职业绝活',
 '考试成绩理想是什么体验', 
 '耳朵的工作量太大了', 
 '芝加哥所有桥梁升起',
 '花木兰放弃北美院线发行',
 '苹果秘密收购以色列相机公司',
 '菠萝芥末油条虾',
 '蒂姆状态',
 '西安业主自管小区一年盈利83万',
 '西班牙将扑杀10万只养殖貂',
 '西电拟清退33名失联超期博士生',
 '课间操跳得像康复训练',
 '贵州吉他村一年产800万把',
 '赵继伟高难度三分',
 '路人看到王俊凯的表情',  
 '跳河救人被冲走司机遗体找到',
 '迪丽热巴裤装造型', #here <--
 '重庆磁器口景区关闭',
 '雪顶气泡葡萄冰',
 '香港设计师绘画赠内地支援队',
 '马主人回应下海救人两匹马去世',
 '骗取贷款嫌疑人李冠君被通缉',
 '高考报考避坑口诀',
 '鹿晗连续6天拍打戏中暑',
 '黄晓明夏日午后大片',
 '黄景瑜喝酒对瓶吹',
 '黄金薯片爆浆拉丝芝士球',
 '黄鹤楼免票首日客流量涨3倍'] 

'''percentage of stepwise 
average of born in rome/sleeping beauty
(1) how long it takes 
(2)the way it reaches the HSL 
(3) contextual, what is about,
related to each other, make relationship between these aspects  
hope to understand the mechanism, depending on....  find relation and quantify 

maybe try different intervals and see how the statistics changes, trial and error 

show typical examples, make averages, how many steps, link to the nature of hashtag/when arrive 

tell problems/limitations, % percent of the data was corrupted 

leave out the statistics, but describe ... within 5 minutes? artificial
the list is manipulated, not folloiwng automated algorithm

method and data : describe the problems 
'''

group33_new = ['人类可爱幼崽翻车图鉴',
 '司凤情人咒发作',
 '唐高祖李渊重孙墓道壁画成功修复',
 '局中人结局',
 '早产月饼涉事厂家和超市被立案查处',
 '景区回应挂张东升禁入告示牌',
 '熊本县营业部长跳无价之姐',
 '白昊天真实身份',
 '第30届金鹰奖提名名单', #only 64 not complete
 '许子言 如果我选爸爸']

group32_new = ['六成租房人群月收入3001至8000元',
 '北京冬奥村样板间首次亮相',
 '吴彤 李宇春从不辜负舞台',
 '小鹏汽车在美上市',
 '父亲第一条朋友圈献给女儿',
 '物理老师用纸杯留声机成功留声',
 '贺子秋贺梅和解']

group31_new = ['Angelababy哭戏',
 '一群山里娃踢出一个全国足球季军',
 '不要卷着放明星照片',
 '中国驴友徒步穿越非洲时感染新冠',
 '吴邪吐血',
 '喜欢林有有的原因',
 '四川一女孩长期遭受家暴失联',
 '在图书馆收获爱情',
 '央视揭秘外卖员送餐全过程',
 '学生骑电动车闯红灯被撞飞负全责',
 '小鸡长在王一博笑点上',
 '接挪车电话找回丢失8年的车',
 '新疆确诊病例无症状感染者全部清零',
 '李现 他们最近自力更生得很好',
 '武大网红小狐狸珞珞再次现身',
 '狗狗获救不停回看救它的消防员',
 '王漫妮相亲对象是王自健',
 '统计局谈为何没出现报复性消费',
 '记者进入国产新冠疫苗生产车间',
 '车辆阻挡救护车急得护士去敲车窗',
 '阿娇头部表面一层已缝66针',
 '饭店用死螃蟹掉包活螃蟹',
 '黄冈金毛认出山东医疗队员']

group23_new = ['2020福布斯中国名人榜',
 '38岁男子常熬夜加班突发耳聋',
 '井柏然易烊千玺相视一笑',
 '以家人之名 CP大乱炖',
 '佟丽娅粉丝',
 '偷偷看望抗洪儿子父亲抢过沙袋扛肩上',
 '八佰首映',
 '医护人员跪地急救抢出黄金6分钟',
 '千万不要养黑猫',
 '厦门大学2020开学典礼',
 '吉杰为郑爽发声',
 '周杰伦晒20年前旧照',
 '多家银行暂停账户贵金属开仓交易',
 '字节跳动称被Facebook抄袭和抹黑',
 '家属不追责老人被狗绳绊倒身亡',
 '家长回应男孩泳池排便被索赔1万5',
 '成都火锅如何无声揽客',
 '援汉医生6个月后陪儿子武大报到',
 '明星航空里程被盗原因',
 '林有有 工具人',
 '梁正贤空间管理大师',
 '王源设计舞台造型',
 '盒马进口海鲜肉禽可查核酸报告',
 '美国新冠肺炎确诊超500万人',
 '美多所大学出现严重疫情',
 '蒙古国捐的3万只羊启动捐赠流程',
 '贺子秋 讨好型人格',
 '还原杭州女子失踪前活动轨迹',
 '这一年真的已经深刻改变了我',
 '钟晓芹陈屿许子言像一家三口',
 '铁三角默契',
 '阚清子发文反对重男轻女',
 '顾佳 人间过绿器',
 '香港反对派议员林卓廷及许智峰被捕']

group22_new = ['15种语言版你曾是少年', 
               '76岁大爷勇救200斤溺水小伙', 
               '吴前好厉害']

group13_new = ['当别人问你的体重',
 '抗洪战士凌晨归队发现营房被淹',
 '时隔221天全国单日票房再度破亿',
 '本周多城市气温将创新低',
 '消防员出警归来收到25份定制礼物',
 '白宫内部咖啡厅员工确诊新冠',
 '自制酸奶软籽红石榴']

group12_new = ['云鹰飞将QGFly对线夫赖',
 '圣地亚哥海岸拍摄到的绝美蓝鲸画面',
 '摩天大楼女性角色',
 '湖人迎8年来季后赛首胜',
 '苹果iOS输入法新增黑人人权emoji']

group11_new = ['如何看待大胃王吃播', 
               '教育部解读高考志愿填报8大热点问题']

group11_rome = ['林书豪23分10助攻', 
                 '生态环境部回应青海木里矿区生态破坏']

group12_rome = ['FPX对阵SN赛事延期',
 '伊朗政府发言人确诊新冠肺炎',
 '戴姆勒因尾气排放造假被罚15亿美元',
 '洛瑞22分',
 '洪涝灾害造成超5480万人次受灾',
 '福厦高铁泉州湾跨海大桥主塔封顶',
 '离开大连须持7日内核酸检测阴性证明',
 '美国探测器在太阳系小行星上发现海洋',
 '里昂淘汰曼城']

group13_rome = ['ZICO将入伍',
 '三浦春马10年前写给自己的信',
 '中学生篡改百名同学志愿被刑拘',
 '八佰片尾曲MV', #从魏晨那个link断了 18:13那里
 '只有云养才能带来快乐',
 '台风巴威过境黄海',
 '吴镇宇模仿陈奕迅',
 '外交部回应中印边境最新事态',
 '山西坍塌饭店现场消防员喊哑嗓子',
 '当反派杠上杠精',
 '援鄂医疗队员代表受邀游湖北']

group22_rome = ['Knight FMVP',
 '三峡水库有效拦蓄长江第3号洪水',
 '于贞声音',
 '小伙追军车送水果感谢抗洪官兵',
 '山西临汾饭店坍塌事故遇难者名单',
 '巨无霸电饭煲章鱼烧',
 '明日之子三强乐团',
 '百花奖将设颁奖典礼',
 '米切尔51分',
 '美国近44.3万儿童感染新冠',
 '老两口因洪水被困邻居用竹竿送饭',
 '苏文浩小作文',
 '陕西修复东汉青铜摇钱树',
 '鼓励学校大小份半份拼菜供餐']


group23_rome = ['中国人均国民总收入首破1万美元',
 '公务员考试考场外台阶堆满垃圾',
 '北京应急响应级别调整不等于解除警报',
 '北方蟑螂还怪可怜的',
 '医保个人账户结存已超8000亿',
 '厦门轮渡各航线停航',
 '国防部回应美拟在日部署中导',
 '录取通知书不得投递至快件箱自提点',
 '成都房产新政15条',
 '新冠确诊疑似患者医保支付12亿',
 '新天地会长被韩国检方传唤',
 '最长寿大熊猫新星庆祝38岁生日',
 '杨幂苹果衬衫', 
 '林书豪错失扳平三分',
 '河北12岁女孩被绑架遇害邻居涉案',
 '深圳航空ZH9209',
 '港交所取消今日盘前交易',
 '港府将免费为全港市民自愿性新冠检测',
 '滴滴重启快的',
 '漫威回应黑豹男主去世',
 '白冰辛巴直播',
 '苹果或将暂缓在越南组装iPhone',
 '见过哪些取得草率的名字',
 '阚清子被经纪人逼减肥',
 '雪莉曾因崔子和母亲断绝关系']


group31_rome = ['16岁少年涉重大刑案在逃',
 '博主回应王府井狗不理包子报警',
 '唐灿妈妈',
 '孙俪妹妹艺考成绩',
 '学生宿舍不超6人等硬性隔离条件取消',
 '张一山宋妍霏分手',
 '徐老师和裤子分手',
 '成毅挑眉杀',
 '报北大考古女生收到50斤礼物',
 '明星直爽发言实录',
 '权志龙露脸自拍',
 '李健工作室辟谣',
 '李登辉病亡',
 '杭州失踪女子家属回应',
 '沈月言承旭CP感',
 '父亲回应留守女儿选北大考古专业',
 '猫咪通宵等主人电话',
 '美团回应骑手问题',
 '蓝盈莹 初舞台第一今天倒数第一',
 '金晨 我没有拿恋情炒作',
 '闫妮白玉兰最佳女主角',
 '黄子韬徐艺洋好甜']

group21_400to500 = ['刘雨昕虞书欣赵小棠主题曲造型',
 '口袋黑巧脆皮冰激凌',
 '孟佳 海平面总有会平静的时候',
 '安倍发告别视频',
 '张公案开机',
 '张雨绮把出战机会给张含韵',
 #'江南百景图同乡会馆',
 '王一博粉丝庆生大赏',
 '王漫妮被同事陷害',
 '电竞为什么没有女职选手',
 '社畜真的是太难了',
 '突如其来的缘分有多好笑',
 '糖豆人维护',
 '芒果运镜',
 '郑希怡受伤']

group23_200to300 = ['Zoom将停止向中国提供直接服务',
 '中国首家螺蛳粉产业学院开课',
 '刘诗诗亲爱的自己',
 '央视中秋晚会首波阵容',
 '孙芮 你们为我创造了奇迹',
 '张雨绮撩头纱太美了',
 '徐艺洋这就是灌篮3',# ended from here, then changed to 
 #crawl data with shorter prehistory
 '掘金快船抢七',
 '李现赵丽颖为张含韵打call',
 '洪水漫上重庆主城',
 '片寄凉太追以家人之名',
 '王漫妮最后还是单身',
 '琉璃编剧',
 '番茄酸汤焖面',
 '谢娜cos王漫妮',
 '贫困县7.1亿豪华中学喷泉凉亭被拆除',
 '退伍军人带4岁女儿军训',
 '郭晶晶现身支持霍启刚竞逐立法会',
 '金城武用烟给周迅点烟花',
 '高考结束是否意味着压力消失']

group21_80to120 = ['10岁导盲犬即将退休主人不舍分开',
 '18岁高考生被评见义勇为',
 '31省份养老金已全部上涨',
 '40年后再从深圳国贸大厦远眺',
 '63岁交警奶奶校门口指挥交通七年',
 '76岁老人救起200多斤溺水者', 
 'GAI rapper不能说对不起',
 '亲爱的自己角色海报', 
 '你镜头下的网红公路',
 '假如林有有遇上洪世贤',
 '冲绳暴发聚集性感染',
 '南京天空之镜石臼湖',
 '厦门立法处罚私放快递柜行为',
 '司凤受刑',  
 '哈利波特重映票房过亿',
 '国内智能终端市场苹果占比21.6%',
 '大部分智能手机均支持北斗功能',
 '如果作家们也喝奶茶',
 '孟佳王霏霏 我们加油',
 '孟佳自制乘风破浪的姐姐番外篇',
 '对在网红公路违规停车拍照者予以重罚',
 '小伙用订书钉搭建微型重庆城',
 '山东沂水回应彩礼费1万元以内',
 '工信部拟建立谢绝来电平台',
 '开学季学生风穿搭',
 '成毅哭戏感染力', 
 '找到适合自己的土壤',
 '暑假余额还剩10天',
 '末代皇帝香港重映', 
 '林俊杰新歌无滤镜',
 '樱花珍珠奶茶汤米粉',
 '毛里求斯触礁日本货轮断成两截',
 '浙江舟山2198艘渔船开渔出海', 
 '深圳地铁10号线8月18日开通',
 '特朗普回应民调输拜登',
 '王安宇周也 校霸和校花',
 '王毅批美国制裁守法国家荒唐透顶',
 '绿豆牛乳脆冰球',
 '美国新冠肺炎超623万例',
 '花木兰确认内地影院上映',
 '被颜永原气死',
 '裙摆好像有了灵魂',
 '西藏军区练兵挺进海拔5000米',
 '谢霆锋回归中国好声音',
 '赵立坚 美国务院发言人倒打一耙',
 '辽宁新增3例本土病例',
 '重启第二季开播',  
 '金晨腹肌',
 '陈建新',
 '香港市民手绘漫画感谢内地支援队',
 '驻港部队汽车兵3分钟徒手换轮胎',
 '魏晨演技']

group32_80to120 = ['三伏天终于过完了',
 '世界各地的15种薯条',
 '司凤璇玑打起来了',
 '哈利波特与魔法石另类解构细节',
 '女生都喜欢小巧的东西吗',
 '张新成童年照撞脸谭松韵',
 '李斯丹妮吃泡芙奶油喷裤子',
 '杨天真要做切胃手术']

group33_80to120 = ['凌霄做牙医', '璇玑差点杀了司凤', 
                   '解放军南海实弹射击训练', '边牧有多万能']

group22_80to120 = ['全国超半数5G核心人才在上海', #'Kanavi的千珏', no crawled data
                   '张掖七彩丹霞热气球节', '最热中伏', 
                   '气运联盟最强厂牌', '腾蛇护璇玑']

group11_80to120 = ['2020年网球中国赛季取消', 
                   '中超7队代表列队欢迎武汉卓尔', 
                   '和平精英PEL冠军', 
                   '皇马西甲第34冠']

group12_80to120 = ['东契奇最年轻单赛季三双王', 
                   '尤文意甲九连冠', 
                   '成都夜间安全过街神器']

new_random33 = ['上海将设家政本科专业',
 '南京大学首封录取通知书',
 '四川安岳杀妻嫌疑人被批捕',
 '外交部提醒在美留学人员加强安全防范',
 '学生教师节送花老师反手回礼练习册',
 '时代周刊封面新冠病毒水淹白宫',
 '昊辰偷换心灯',
 '李书福称正在研发核酸检测汽车',
 '翟潇闻企鹅打挺',
 '西藏军区演练无人机为前线送餐',
 '该不该向孩子解释死亡',
 '谭松韵妈妈被撞案肇事者否认吸毒',
 '这大概就是亲情最好的状态',  
 '郭敬明微电影太好哭了', 
 '香港大学副教授戴耀廷被解雇']

new_random32 = ['不得单方面提高或者降低租金',
 '人狗互动的最高境界',
 '伊能静教金莎和男生聊天',
 '北京首钢战胜广东宏远', 
 '携号转网服务用户破千万',
 '珠海大桥一货车侧翻坠海',
 '给杨幂手绘图填色',
 '老师别再用全景相机拍照了',
 '腾讯视频年度发布会',
 '赵丽颖发布会造型',
 '黄正音申请离婚']

new_random31 = ['1.71秒算出15笔6位数加减',
 '凌霄的肩膀是陈婷烫伤的',
 '动力电池迎来报废高峰期',
 '吴邪被十一仓开除',
 '外交部驳斥美称中国操纵湄公河水资源',
 '帕梅拉跳无价之姐', 
 '张杰给王漫妮唱他不懂',
 '教养好的男生有多加分',
 '永州被踹伤猥亵男主治医生回应',
 '汉堡王声明',
 '燃灯校长张桂梅让贫困孩子飞出大山',
 '王菲马云合唱如果云知道',
 '邓超送白玉兰花安慰孙俪',
 '陈一鸣面试被羞辱',
 '陈宝国白玉兰最佳男主角']

new_random22 = ['像极了学车时的我',
 '全国降水排行榜',
 '周迅再唱天涯歌女',
 '商务部回应中美商定将于近日举行通话',
 '抗洪战士为不扰民在市区外席地而睡',
 '男生穿上制服有多帅',
 '药水哥淘汰']

new_random13 = ['上海国际电影电视节7月25日起举办',
 '国安击败泰达',
 '当代美好生活图鉴', 
 '日本首相安倍复工',
 '明日之子手绘群像手书',
 '胡宇桐打鼓好帅',
 '赛朋雄安']

new_random12 = ['南京消防员驰援安徽抗洪', 
                '塞维利亚击败国米', 
                '我国粮价稳中有涨', 
                '杨智退役', 
                '梁颖道歉信']

new_random11 = ['嫦娥四号进入第21月昼工作期',
 '新版上证综指',
 '艾美奖线上举办',
 '金堂启动红色汛情预警',
 '阿德巴约关键盖帽'] ##'俄卫生部长回应疫苗安全性受质疑',

#------------------------
inter21 = ['33个县GDP破千亿',
 '丁禹兮复古慵懒夹克',
 '上半年我国基金规模突破16.9万亿',
 '世卫结束在华新冠溯源预备性磋商',
 '从幸福到灾难只需要一瞬间',
 '信条撤档', 
 '全国首个聋哑人快递团队',
 '医疗机构严禁利用名称误导患者',
 '原来长颈鹿是这样喝水的',
 '去东京旅行要做的100件事',
 '大凉山瓦吉吉村第一个女大学生',
 '山东禁食陆生野生动物',
 '巴黎塞纳河畔开设漂浮影院',
 '德国大叔的无声面包店',
 '成都人眼里的成都',
 '挨父母打对人生的影响',
 '日本京都市推广手持口罩',
 '普快列车可互联网订餐',
 '李斯丹妮哭得太好笑了',
 '李荣浩吃瓜吃到自己身上',
 '校方回应毕业生考四六级需隔离7天',
 '江西警方悬赏30万缉拿曾春亮',
 '漂流完四只脚各穿各的',
 '爱尔兰狗粮工厂发生聚集性感染',
 '玫瑰糍粑气泡冰粉',
 '男孩吃葡萄过敏肿成嘟嘟嘴',
 '福建下海救人的第三匹马已痊愈',
 '美国俄亥俄州州长新冠检测阳性',
 '胡歌透明水幕大片',
 '胧月原作者为金莎发声',
 '虞书欣翻不过去跟头',
 '蚂蚁集团概念股',
 '被洪水卷走的排长目前生命体征平稳',
 '被狗子耽误的物理老师',
 '被遗弃德牧已被部队收养为军犬',
 '警方成立南宁女子失踪专案组',
 '许光汉 能干又能吃',  
 '贵阳背猪汉和女儿温情对话',
 '那些毫无违和感的视频',
 '韩国首都圈聚集性感染频发',
 '颜怡颜悦脚本 催婚', 
 '高校食堂光盘可免费换水果',
 '默克尔称欧盟期待与中方进一步合作']

inter23 = ['15.6寸的电脑到底有多重', #15th, 贵阳师兄, 2020-09-03 08:37:26    
 '1岁半小萌娃给武警哨兵送糖果',
 '23岁女子心脏停跳3天奇迹治愈',
 'AKB48成员确诊新冠肺炎',
 '两名驴友被困网红瀑布悬挂一夜',
 '以家人之名超长片花',
 '傲娇歌词',
 '南京舒克贝塔公司被要求改名',
 '南京遇害女生父亲再发声',
 '只有一个老师的学校',
 '大爷卖鹅违章交警全部买下',
 '失踪的耳机终于找到了',
 '奥巴马夫人自曝患抑郁症',
 '安倍政府全体辞职',
 '山西倒塌饭店过寿老人发声',
 '张靓颖绯闻男友发长文',
 '杀人犯未按规服刑死者母亲发声',
 '李尖尖给树洞投稿',
 '检方回应女子不堪家暴跳楼',
 '楚歌哭戏',
 '武汉7.2万名初三考生迎中考',
 '江南百景图马文才',
 '江疏影好美',
 '男生录取北大骑马戴红花返乡',
 '疫情或令1亿人重返极端贫困',
 '美颜滤镜下的李现',
 '言承旭身材',
 '警方确认芦名星系自杀',
 '钟晓芹怎么还不离婚',
 '陈学冬碟中谍',
 '骊歌大婚',
 '鼓励事业单位对高层次人才实行年薪制']

inter31 = ['大张伟真实', #68th, 2020-08-26 22:21:41 #114th 2020-08-26 21:00:06    
 '杭州杀妻男子曾称身正不怕影子斜',
 '林有有动摇了凌玲在我心中的位置',
 '海底捞告河底捞商标侵权被驳回',
 '漫威群星悼念黑豹男主',
 '白色月光真实',  
 '重启剧组火锅局直播',
 '韩国老牌泡菜厂出现集体感染']

inter33 = ['学校回应安排中考生住浴场大厅',
 '日本近500家公司破产',
 '昆明烂尾楼开发商被列失信后仍卖房',
 '星巴克中国回应店员拒收硬币',
 '李佳琦梁静黄晓明直播',
 '贪玩公司申请渣渣辉商标被驳回']
inter32 = ['水果弹珠冰糖葫芦', 
           '阻止车辆过桥30秒后桥塌了']

inter22 = ['台风天打伞有多难', 
           '因为名字产生的误会', 
           '林俊杰孙燕姿新歌MV'] #14th



inter22_2 = ['全国多地景区门票降价',
 '北京电影院上座率上限调至50%',
 '北京电影院开启预售',
 '哆啦艾米55',
 '商务部将出台制止餐饮浪费措施',
 '当李宇春以为自己稳了',
 '影院复工前三天票房超1300万',
 '时刻保持微笑的方法', #松鼠娱评  #2020-08-19 15:11:34
 '河南延津村民靠捉蟋蟀致富',
 '深圳进入强制垃圾分类时代',
 '狗妈妈冲进洪水救孩子',
 '皮尔洛出任尤文主帅',
 '神盾局特工第七季完结',
 '第一视角的极速光轮有多爽',
 '素媛案罪犯首次表示忏悔',
 '被孙雯雯气死',
 '香港新增确诊80例']

inter12 = ['信条票房破3亿', 
           '巡逻遇冰雹边防官兵围在一起', 
           '白宫发言人坚称学校要复课']
inter13 = ['何雪琳人设', 
           '失去家的玩具们']

inter11 = ['大雨中的逆行者']

inter23_2 = ['676分留守女生北大班主任发声',
 '99元买烧鸡送免费旅游被叫停',
 '一次喝3.2L水致水中毒',
 '三十而已样片泄露出品方报警',
 '上海市中心最后一家花鸟市场关闭',
 '上海徐汇滨江亲水平台遭船只撞击',
 '严禁挤占体育课和体育活动时间',
 '中国赴黎巴嫩维和部队待命救援',
 '乘风破浪的姐姐评判标准',
 '五人出游一人还事件舅舅起诉外甥女',
 '任嘉伦发长文告别暮白首',
 '余杭回应招清北毕业生去街道工作',
 '信小呆一元转让中国锦鲤',
 '全班按手印不惹怀孕老师生气',
 '农科院毒诱饵形似火腿肠被捡走',
 '刘宪华居家版bad guy',
 '初中生把西游记画成81难通关图',
 '厂家回应月饼生产日期提前标注',
 '原来部队生活这么有意思',
 '双腿截肢小伙成为健身教练', 
 '向四川等地拨付4.6亿元中央救灾资金',
 '在男朋友的衣服上绣花',
 '多家航空公司恢复飞机餐', 
 '大二男生神还原动漫名场面',
 '大数据杀熟行为10月1日起明令禁止',
 '大熊猫雷雷死亡',
 '央视七夕晚会emoji节目单',
 '央视曝光保健品新骗局',
 '女生生气容易导致',
 '女童3岁被喂到70斤母亲回应',
 '如何在两分钟内睡着',
 '如何看待梁颖罗冠军事件',
 '姐姐团名叫什么',
 '姐姐成团 花少',
 '安徽六安金寨遭遇极端暴雨', #澎湃新闻
 '居然被一只猫帅到了',
 '川大学生收到自己参与设计的通知书',
 '库克身家超10亿美元',
 '开学后父母开始报复性消费',
 '张月发文与林有有道别',
 '张纪中承认再婚',
 '张继科脾气',
 '张萌录视频道歉',
 '张雨绮回应伊能静小作文',
 '当代年轻人吃外卖',
 '律师谈老人被狗绳绊倒身亡',
 '徐振轩方否认恋情',
 '德云社团建', #start 38th
 '懒人麻辣拌万能吃法',
 '戚薇吐槽工作室P图',
 '拜登首度携竞选搭档亮相',
 '搜狗回应腾讯收购要约',
 '新疆现有3016人接受医学观察',
 '日本单日新增新冠确诊首次破千',
 '昆明烂尾楼别样幸福城复工',
 '朴树 以后不会再当老师了',
 '李宇春最后一秒含泪捞人',
 '杨靖宇殉国前百日战斗档案',
 '梁正贤是海王吗',
 '欧阳娜娜回应提议重录',
 '每克黄金赚60元以上',
 '江苏一公司要求员工改用国产手机',
 '沈腾公司名字',
 '泰国国王为诗妮娜贵妃作画',
 '港警国安处首次行动逮捕4人',
 '熊猫叫声原来是这样的',
 '牵狗女孩称没看到老人被狗绳绊倒',
 '特朗普回应班农被捕',
 '王嘉尔震惊到说了九个哇', 
 '王府井狗不理差评视频拍摄者发声',
 '王漫妮 梁正贤',
 '玲花点赞diss徐明朝微博',
 '男生从清华退学后重读考699分',
 '突然喊老公的全名',
 '美国确诊新冠新增100万人只用了15天',
 '美国部分疫情数据从疾控中心网站删除',
 '脆皮牛奶雪媚娘', #牛奶少女丶 下一个
 '艾福杰尼 医学奇迹',
 '英国暂停为港警提供军事训练项目',
 '许幻山开始嫌弃顾佳',
 '贺子秋我再也不走了',
 '贾玲刘敏涛方言版伪装者',
 '近7成受访美企对中国市场前景乐观',
 '郑钧为水木年华抱不平',
 '钟汉良为什么淘汰肖杰',
 '锅传锅',
 '陕西6岁男童被火车撞伤截肢续',
 '雪山焦糖豆乳绵绵冰',
 '鞠翼铭参加的是变形计吧',
 '高圆圆送李佳琦唢呐曲谱',
 '高考考出高中以来最高分喜极而泣',
 '鹿晗被小学生跟拍',
 '黄河出现2020年第2号洪水',
 '黎巴嫩首都发生大规模示威活动'] 

new_below7_21 = ['10支核酸检测医疗队驰援乌鲁木齐',
 '7旬奶奶用旧衣改造时装',
 '90后汶川地震幸存女孩成老师',
 '万茜粉丝投票',
 '北京中小学开学后不会急于考试',
 '印度男子为亡妻建造1比1硅胶像',
 '厄瓜多尔确诊首例新冠二次感染病例',
 '周梓倩是可爱还是绿茶',
 '强降雨已致四川超10万人受灾',
 '支教老师在石阶上刻1700多个汉字',
 '明起医护人员可申领电子证照',
 '有些鸭走着走着就散了',
 '李易峰森系封面', 
 '杨幂粉色挑染马尾',
 '武汉新增境外输入3例',
 '玄武湖并蒂莲蓬被制成标本展出',
 '琉璃超前预告',
 '福建71年来7月首次无台风', 
 '罗翔谈张玉环案',
 '美国24小时新增新冠超4万例',
 '西藏军区海拔4900多米实弹射击演练',
 '詹姆斯发声支持罢赛',
 '豆浆煮奶茶',
 '郑希怡姨母笑表情包大赛',
 '阿富汗政府与塔利班启动和谈',
 '鸡蛋价格一个月飙涨逾六成']

new_below7_31 = ['中俄发布外交部长联合声明',
 '前台湾偶像歌手在成都当牙医',
 '卖水救母女孩被哈尔滨医科大学录取',
 '团伙制售假冒女性护理品成本20卖400',
 '备降西安东航航班舱内视频',
 '李宇春没想到得罪了那么多娱记',
 '腾讯向搜狗发出初步非约束性收购要约',
 '韩国数万名医生罢工']

new_below7_22 = ['16省份上半年GDP正增长', 
                 '2号洪峰将过境重庆万州', 
                 '徐杰好稳']

new_below7_32 = ['外交部回应英国将暂停与香港引渡条约', 
                 '开越野车碾压草场者道歉']

new_below7_33 = ['2020年全球最富有25个家族', 
                 '孙弈秋偷合同']

new_below7_11 = ["武汉文旅局倡议市民错峰出游"]

new_below7_12 = ['2020年首只秦岭大熊猫宝宝诞生',
 '上海浦东机场货机火灾已扑灭',
 '朱广权的七夕段子',
 '水果弹珠果冻',
 '满脑子都是太空弹',
 '福建省考资料分析']

for keyword in inter23_2[47:48]:   # try just one element in the list #social_hashtags:
    os.chdir(cwd + "/" + type_group_cluster)  #working directory 很重要！！！
    if keyword + "keywordpost.txt" in  os.listdir():	
        df = pd.read_csv(keyword + "keywordpost.txt", sep = "\t")
        filtered_df = df[df['转发数'].notnull()] 
        filtered_df = filtered_df[filtered_df['发布时间'].str.contains('今') == False]
        print(len(filtered_df))
        filtered_new = filtered_df.drop_duplicates()
        print(len(filtered_new))
        # 再爬一遍不包含keyword的吧，因为存在展开全文这个东西。。。
        #filtered_new = filtered_df[~filtered_df["发布内容"].str.contains(keyword)]
        #filtered_new = filtered_df[filtered_df['发布内容'].str.contains(keyword, na=False)]
        # Filter out the rows that doesn't include the hashtag !!!!!!!!!!
        keyword_url_list = list(filtered_new["手机版链接"]) 

        print(keyword, len(keyword_url_list))

	##### make new dir to store reposts and change to new dir 

        dir = cwd + "/" + type_group_cluster + "/" + keyword ##!!!!!!!

        if not os.path.exists(dir):
            os.mkdir(keyword) 

        os.chdir(cwd +  "/" + type_group_cluster + "/" + keyword)

	## start crawling reposts in the new dir 
        #for i in range(29, 30): ##Notice the beginning number !!!!!!!!!! #应该53！
        for i in range(37, len(keyword_url_list)): ##Notice the beginning number !!!!!!!!!! #应该53！
            print("This is the {}th mobile repost link".format(i+1)) 
            GetRepost(getUrlList(keyword_url_list[i])) 
            print("The {}th mobile repost link is done.".format(i+1))

        print("The whole crawling is done." + keyword)

##########-------------------------------------------------##################







